warewolf/platform_bk7231t/bk7231t_os/beken378/ip/mac/mac_frame.h
#define MAC_DELBA_PARAMSET_OFT          2
#define MAC_DELBA_REASON_OFT            4

/*
*--------------------------------------------------------------------------------------*
*-----------------------------------Block Ack END------------------------------------------
*--------------------------------------------------------------------------------------*
*--------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------
*---------------------------------TDLS Action Frames----------------------------------
*---------------------------------------------------------------------------------------
*/


/* CATEGORY \ ACTION values
*--------------------------------------------------------------------------------------*/
#define MAC_TDLS_ACTION_SETUP_REQ           0
#define MAC_TDLS_ACTION_SETUP_RSP           1
#define MAC_TDLS_ACTION_SETUP_CFM           2
#define MAC_TDLS_ACTION_TEARDOWN            3
#define MAC_TDLS_ACTION_PEER_TRAFFIC_IND    4
#define MAC_TDLS_ACTION_CHANSW_REQ          5
#define MAC_TDLS_ACTION_CHANSW_RSP          6
#define MAC_TDLS_ACTION_PEER_TRAFFIC_RSP    9
#define MAC_TDLS_ACTION_DISCOVERY_REQ       10

#define TDLS_CHANSW_REQ_TARGET_CH_OFFSET    2
#define TDLS_CHANSW_REQ_OP_CLASS            3
#define TDLS_CHANSW_REQ_IES_OFFSET          4
#define TDLS_CHANSW_REQ_IE_SEC_CH_OFT_LEN   3
#define TDLS_CHANSW_REQ_IE_LINK_ID_LEN      20
#define TDLS_CHANSW_REQ_IE_CH_SWITCH_TIMING_LEN 6
#define TDLS_CHANSW_REQ_IE_WIDE_BW_CHAN_SWITCH_LEN 5

#define TDLS_CHANSW_RSP_STATUS_OFFSET       2
#define TDLS_CHANSW_RSP_IES_OFFSET          4

#define TDLS_CHANSW_REQUEST_ACCEPTED        0
#define TDLS_CHANSW_REQUEST_DECLINED        37

#define TDLS_PEER_TRAFFIC_IND_IES_OFFSET    3
#define TDLS_PEER_TRAFFIC_IND_IE_LINK_ID_LEN 20
#define TDLS_PEER_TRAFFIC_IND_IE_PTI_CTRL_LEN 5
#define TDLS_PEER_TRAFFIC_IND_IE_TPU_BUF_STATUS_LEN 3

#define TDLS_PEER_TRAFFIC_RSP_IES_OFFSET    3
#define TDLS_PEER_TRAFFIC_RSP_IE_LINK_ID_LEN 20

/*
*--------------------------------------------------------------------------------------*
*-----------------------------------TDLS END------------------------------------------
*--------------------------------------------------------------------------------------*
*--------------------------------------------------------------------------------------*/


/*
 * LINK Management Defines
 */

#define MAC_HEAD_HT_OFT                  32
#define MAC_MAI_MASK                     0x003C
#define MAC_MAI_OFT                      2
#define MAC_MAI_IND_ASELI                14
#define MAC_MFB_MASK                     0xFE00
#define MAC_MFB_OFT                      9
#define NO_FEEDBACK                      127
#define MAC_ADDR2_OFT                    10
#define MCS_IDX3_MASK                    0x0000FF
#define MCS_IDX2_MASK                    0x00FF00
#define MCS_IDX1_MASK                    0xFF0000
#define MCS_IDX2_OFT                     8
#define MCS_IDX1_OFT                     16


/* ------------------------------------------------------------------------------------ *
 * ------------------ Spectrum & Power Management Frame Offset ------------------------ *
 * ------------------------------------------------------------------------------------ */

#define MAC_ACTION_FRAME_INFO_OFT           3
#define MAC_ACTION_CH_SWITCH_FRAME_INFO_OFT 2
#define MAC_ACTION_FRAME_PRE_INFO_LEN       3

//Spectrum & Power Management Element Offset

// Power Constraint Element
#define MAC_INFOELT_POWER_CONSTRAINT_OFT     2

#define MAC_POWER_CONSTRAINT_ELT_LEN         3

// Power Capability Element
#define MAC_INFOELT_MIN_TX_POWER_OFT         2
#define MAC_INFOELT_MAX_TX_POWER_OFT         3

#define MAC_POWER_CAPABILITY_ELT_LEN         4
#define MAC_POWER_CAPABILITY_ELT_LEN_FIELD   2

// TPC Report Info Element sub-offsets
#define MAC_INFOELT_TX_POWER_OFT             2
#define MAC_INFOELT_LINK_MARGIN_OFT          3

// TPC Report and Request IE lengths
#define MAC_TPC_REQUEST_ELT_LEN              2
#define MAC_TPC_REPORT_ELT_LEN               4
// TPC Report and Request IE's length field values
#define MAC_INFOELT_LEN_VAL_TPC_REQ          0
#define MAC_INFOELT_LEN_VAL_TPC_REP          2
// TPC Report and Request Action frame lengths
#define MAC_ACTION_FRAME_TPC_REQ_LEN         5
#define MAC_ACTION_FRAME_TPC_REP_LEN         7


// Supported Channels Element
#define MAC_INFOELT_FIRST_CHANNEL_OFT        2
#define MAC_INFOELT_NUMBER_CHANNEL_OFT       3

// Channel Switch Announcement Element
#define MAC_INFOELT_SWITCH_MODE_OFT          2
#define MAC_INFOELT_SWITCH_NEW_CHAN_OFT      3
#define MAC_INFOELT_SWITCH_COUNT_OFT         4

#define MAC_CHANNEL_SWITCH_INFO_LEN          3
#define MAC_CHANNEL_SWITCH_ELT_LEN           5

// Extended Channel Switch Announcement Element
#define MAC_INFOELT_EXT_SWITCH_MODE_OFT      2
#define MAC_INFOELT_EXT_SWITCH_NEW_CLASS     3
#define MAC_INFOELT_EXT_SWITCH_NEW_CHAN_OFT  4
#define MAC_INFOELT_EXT_SWITCH_COUNT_OFT     5

#define MAC_EXT_CHANNEL_SWITCH_INFO_LEN      4
#define MAC_EXT_CHANNEL_SWITCH_ELT_LEN       6

// Secondary Channel Offset Element
#define MAC_INFOELT_SEC_CH_OFFSET_OFT        2

#define MAC_INFOELT_SEC_CH_OFFSET_INFO_LEN   1
#define MAC_INFOELT_SEC_CH_OFFSET_ELT_LEN    3

#define MAC_INFOELT_SEC_CH_OFFSET_SEC_CH_OFT 2
#define MAC_INFOELT_SEC_CH_OFFSET_NO_SEC_CH  0
#define MAC_INFOELT_SEC_CH_OFFSET_SEC_ABOVE  1
#define MAC_INFOELT_SEC_CH_OFFSET_SEC_BELOW  3

// Wide BAndwidth Channel switch
#define MAC_INFOELT_WIDE_BW_CHAN_SWITCH_NEW_CW_OFT 2
#define MAC_INFOELT_WIDE_BW_CHAN_SWITCH_NEW_CENTER1_OFT 3
#define MAC_INFOELT_WIDE_BW_CHAN_SWITCH_NEW_CENTER2_OFT 4
#define MAC_INFOELT_WIDE_BW_CHAN_SWITCH_INFO_LEN 3
#define MAC_INFOELT_WIDE_BW_CHAN_SWITCH_ELT_LEN  5

// Measurement Request/Report Element
#define MAC_INFOELT_MEASURE_TOKEN_OFT        2
#define MAC_INFOELT_MEASURE_MODE_OFT         3
#define MAC_INFOELT_MEASURE_TYPE_OFT         4
#define MAC_INFOELT_MEASURE_CH_NBR_OFT       5
#define MAC_INFOELT_MEASURE_START_TIME_OFT   6
#define MAC_INFOELT_MEASURE_DURATION_OFT     14

#define MAC_INFOELT_MEASURE_INFO_OFT        16

#define MAC_MEAS_REQ_CNF_ELT_LEN             5
#define MAC_MEAS_REQ_ELT_LEN                16
#define MAC_MEAS_REQ_FRAME_LEN              19
#define MAC_MEAS_REP_BASIC_ELT_LEN          17
#define MAC_MEAS_REP_BASIC_FRAME_LEN        20
#define MAC_MEAS_REP_CCA_ELT_LEN            17
#define MAC_MEAS_REP_CCA_FRAME_LEN          20
#define MAC_MEAS_REP_RPI_ELT_LEN            24
#define MAC_MEAS_REP_RPI_FRAME_LEN          27
#define MAC_MEAS_REP_ERR_ELT_LEN             5
#define MAC_MEAS_REP_ERR_FRAME_LEN           8

