warewolf/platform_bk7231t/bk7231t_os/beken378/ip/mac/mac_frame.h
// Mobility Domain Element (MDE)
#define MAC_INFOELT_MDE_ID_OFT               0
#define MAC_INFOELT_MDE_LEN_OFT              1
#define MAC_INFOELT_MDE_MDID_OFT             2
#define MAC_INFOELT_MDE_FT_CAPA_POL_OFT      4
#define MAC_INFOELT_MDE_MDID_LEN             2
#define MAC_INFOELT_MDE_FT_CAPA_POL_LEN      1
#define MAC_INFOELT_MDE_ELMT_LEN             3
#define MAC_INFOELT_MDE_LEN                  5

// Link Identifier Element
#define MAC_INFOELT_LINK_ID_LEN              18
#define MAC_INFOELT_LINK_ID_BSSID_OFT        2
#define MAC_INFOELT_LINK_ID_INIT_STA_OFT     8
#define MAC_INFOELT_LINK_ID_RESP_STA_OFT     14

// Link Identifier Element
#define MAC_INFOELT_CH_SWITCH_TIMING_LEN     4
#define MAC_INFOELT_CH_SWITCH_TIMING_SWTIME_OFT 2
#define MAC_INFOELT_CH_SWITCH_TIMING_SWTOUT_OFT 4

// PTI Control Element
#define MAC_INFOELT_PTI_CONTROL_LEN          3
#define MAC_INFOELT_PTI_CONTROL_TID_OFT      2
#define MAC_INFOELT_PTI_CONTROL_SEQ_CTRL_OFT 3

// TPU Buffer Status Element
#define MAC_INFOELT_TPU_BUF_STATUS_LEN       1
#define MAC_INFOELT_TPU_BUF_STATUS_AC_STATUS 2

// Spectrum management frame values:
//----------------------------------

//TO_DO_MMH:Remove unused fields

//MAC Action Spectrum Categorie => Sub Action
#define MAC_ACTION_MEASURE_REQUEST        0
#define MAC_ACTION_MEASURE_REPORT         1
#define MAC_ACTION_TPC_REQUEST            2
#define MAC_ACTION_TPC_REPORT             3
#define MAC_ACTION_CHANNEL_SWITCH         4

// Channel Switch Annoncement Mode
#define MAC_SWITCH_MODE_TX_TRAFFIC_CONT   0
#define MAC_SWITCH_MODE_TX_TRAFFIC_STOP   1

// Measurement Request Mode
#define MAC_MEASURE_MODE_ENABLE           CO_BIT(1)
#define MAC_MEASURE_MODE_REQUEST          CO_BIT(2)
#define MAC_MEASURE_MODE_REPORT           CO_BIT(3)

// Measurement Report Mode
#define MAC_MEASURE_MODE_LATE             CO_BIT(0)
#define MAC_MEASURE_MODE_INCAPABLE        CO_BIT(1)
#define MAC_MEASURE_MODE_REFUSED          CO_BIT(2)

// Measurement Request Type
#define MAC_MEASURE_TYPE_BASIC            0
#define MAC_MEASURE_TYPE_CCA              1
#define MAC_MEASURE_TYPE_RPI              2

// Measurement Report Map Bits
#define MAC_MEASURE_MAP_FREE              0x00
#define MAC_MEASURE_MAP_BSS               CO_BIT(0)
#define MAC_MEASURE_MAP_OFDM              CO_BIT(1)
#define MAC_MEASURE_MAP_UNIDENTIFIED      CO_BIT(2)
#define MAC_MEASURE_MAP_RADAR             CO_BIT(3)
#define MAC_MEASURE_MAP_UNMEASURED        CO_BIT(4)
#define MAC_MEASURE_MAP_MASK              0x1F

/*
 * We set the default switch count to Zero which indicates that the switch shall occur at
 * any time after the frame containing the element is transmitted.
 * This is done to be able to give the STA time to know the new channel number in case the
 * channel switch fails and another new channel was decided
 */
#define MAC_DEFAULT_SWITCH_COUNT            0
#define MAC_DEFAULT_RADAR_CHECK_TIME        60

enum
{
    REMOTE_MEAS_REQ_LATE = 1,
    REMOTE_MEAS_REQ_INCAPABLE,
    REMOTE_MEAS_REQ_REFUSED
};

/* ------------------------------------------------------------------------------------ *
 * ----------------- Spectrum & Power Management Frame Offset End --------------------- *
 * ------------------------------------------------------------------------------------ */

/*
*---------------------------------------------------------------------------------------
*--------------------------------- HT Action Frames------------------------------------
*---------------------------------------------------------------------------------------
*/


/* HT Action Field values
*--------------------------------------------------------------------------------------*/

#define MAC_CHAN_WIDTH_HT_ACTION                0
#define MAC_SMPS_HT_ACTION                      1
#define MAC_PSMP_HT_ACTION                      2
#define MAC_SET_PCO_PHASE_HT_ACTION             3
#define MAC_CSI_HT_ACTION                       4
#define MAC_NON_COMP_BEAMFORMING_HT_ACTION      5
#define MAC_COMP_BEAMFORMING_HT_ACTION          6
#define MAC_ASEL_INDICES_FEEDBACK_HT_ACTION     7


/* HT channel width offsets
*--------------------------------------------------------------------------------------*/
#define MAC_CHAN_WIDTH_WIDTH_OFT                2

/* HT SM Power Control field offset
*--------------------------------------------------------------------------------------*/
#define MAC_SM_PRW_CTRL_OFT                     2
#define MAC_SMPS_ENABLE_BIT                     CO_BIT(0)
#define MAC_SMPS_DYNAMIC_BIT                    CO_BIT(1)


/*
*---------------------------------------------------------------------------------------
*--------------------------------- VHT Action Frames------------------------------------
*---------------------------------------------------------------------------------------
*/


/* VHT Action Field values
*--------------------------------------------------------------------------------------*/

#define MAC_COMP_BEAMFORMING_VHT_ACTION         0
#define MAC_GROUP_ID_MGMT_VHT_ACTION            1
#define MAC_OP_MODE_NOTIF_VHT_ACTION            2


/* GroupId management offsets
*--------------------------------------------------------------------------------------*/
#define MAC_GROUP_ID_MGT_PAYL_LENGTH            26
#define MAC_GROUP_ID_MGT_MEMBERSHIP_OFT         2
#define MAC_GROUP_ID_MGT_USER_POS_OFT           10


/* VHT operation mode notification offsets
*--------------------------------------------------------------------------------------*/
#define MAC_OP_MODE_NOTIF_OPMODE_OFT            2
#define MAC_OPMODE_BW_OFT                       0
#define MAC_OPMODE_BW_MSK                       (0x3 << MAC_OPMODE_BW_OFT)
#define MAC_OPMODE_RXNSS_OFT                    4
#define MAC_OPMODE_RXNSS_MSK                    (0x7 << MAC_OPMODE_RXNSS_OFT)
#define MAC_OPMODE_RXNSS_TYPE_BIT               CO_BIT(7)


/*
* ELEMENT ID DEFINITION (Table 20 page 55)
****************************************************************************************
*/
#define MAC_INFOELT_ID_OFT                0
#define MAC_INFOELT_LEN_OFT               1
#define MAC_INFOELT_INFO_OFT              2

#define MAC_ELTID_SSID                    0
#define MAC_ELTID_RATES                   1
#define MAC_ELTID_FH                      2
#define MAC_ELTID_DS                      3
#define MAC_ELTID_CF                      4
#define MAC_ELTID_TIM                     5
#define MAC_ELTID_IBSS                    6
#define MAC_ELTID_COUNTRY                 7             // optional
#define MAC_ELTID_HOP_PARAM               8             // optional
#define MAC_ELTID_HOP_TABLE               9             // optional
#define MAC_ELTID_REQUEST                10             // optional
#define MAC_ELTID_BSS_LOAD               11
#define MAC_ELTID_EDCA_PARAM             12

#define MAC_ELTID_CHALLENGE              16
#define MAC_ELTID_POWER_CONSTRAINT       32             // Spectrum & Power Management
#define MAC_ELTID_POWER_CAPABILITY       33             // Spectrum & Power Management
#define MAC_POWER_CAPABILITY_IE_LEN      2              // Spectrum & Power Management
#define MAC_ELTID_TPC_REQUEST            34             // Spectrum & Power Management
#define MAC_ELTID_TPC_REPORT             35             // Spectrum & Power Management
#define MAC_ELTID_SUPPORTED_CHANNELS     36             // Spectrum & Power Management
#define MAC_ELTID_CHANNEL_SWITCH         37             // Spectrum & Power Management
#define MAC_ELTID_MEASUREMENT_REQUEST    38             // Spectrum & Power Management
#define MAC_ELTID_MEASUREMENT_REPORT     39             // Spectrum & Power Management
#define MAC_ELTID_QUIET                  40             // Spectrum & Power Management
#define MAC_ELTID_IBSS_DFS               41             // Spectrum & Power Management

#define MAC_ELTID_ERP                    42
#define MAC_ELTID_HT_CAPA                45
#define MAC_ELTID_QOS_CAPA               46
#define MAC_ELTID_RSN_IEEE               48
#define MAC_ELTID_EXT_RATES              50
#define MAC_ELTID_MDE                    54  // Mobility Domain
#define MAC_ELTID_FTE                    55  // Fast BSS Transition
#define MAC_ELTID_SUPP_OPER_CLASS        59
#define MAC_ELTID_EXT_CHANNEL_SWITCH     60
#define MAC_ELTID_SEC_CH_OFFSET          62
#define MAC_ELTID_20_40_COEXISTENCE      72
#define MAC_ELTID_OBSS_SCAN_PARAM        74
#define MAC_ELTID_MGMT_MIC               76
#define MAC_ELTID_HT_OPERATION           61
#define MAC_ELTID_LINK_IDENTIFIER        101
#define MAC_ELTID_CHANNEL_SWITCH_TIMING  104
#define MAC_ELTID_PTI_CONTROL            105
#define MAC_ELTID_TPU_BUFFER_STATUS      106
#define MAC_ELTID_MESH_CONF              113
#define MAC_ELTID_MESH_ID                114
#define MAC_ELTID_MESH_LINK_METRIC_REP   115
#define MAC_ELTID_CONGESTION_NOTIF       116
#define MAC_ELTID_MESH_PEER_MGMT         117
#define MAC_ELTID_MESH_CHAN_SWITCH_PARAM 118
#define MAC_ELTID_MESH_AWAKE_WINDOW      119
#define MAC_ELTID_MESH_GANN              125
#define MAC_ELTID_MESH_RANN              126
#define MAC_ELTID_EXT_CAPA               127 // This number need to be confirmed.
#define MAC_ELTID_MESH_PREQ              130
#define MAC_ELTID_MESH_PREP              131
#define MAC_ELTID_MESH_PERR              132
#define MAC_ELTID_VHT_CAPA                   191
#define MAC_ELTID_VHT_OPERATION              192
#define MAC_ELTID_WIDE_BANDWIDTH_CHAN_SWITCH 194
#define MAC_ELTID_VHT_TRANSMIT_PWR_ENVELOP   195
#define MAC_ELTID_CHAN_SWITCH_WRP            196
#define MAC_ELTID_OUI                    221 // Proprietary   (0xDD)

#define MAC_OUI_TYPE_WPA                  1
#define MAC_OUI_TYPE_WME                  2
#define MAC_OUI_SUBTYPE_WME_INFORMATION   0
#define MAC_OUI_SUBTYPE_WME_PARAMETER     1
#define MAC_OUI_TYPE_WMMAC                2
#define MAC_OUI_SUBTYPE_WMMAC_TSPEC       2
#define MAC_OUI_SUBTYPE_WMMAC_TSDELAY     8
#define MAC_OUI_SUBTYPE_WMMAC_TSINFO      10

// WME IE OFFSET
#define MAC_OUI_PARAM_QOS_INFO_OFT        8
#define MAC_OUI_PARAM_RESERVED_OFT        9
#define MAC_OUI_PARAM_BK_PARAM_OFT       14
#define MAC_OUI_PARAM_BE_PARAM_OFT       10
#define MAC_OUI_PARAM_VI_PARAM_OFT       18
#define MAC_OUI_PARAM_VO_PARAM_OFT       22

