warewolf/platform_bk7231t/bk7231t_os/beken378/ip/mac/mac_frame.h
/*
 * STATUS CODE
 ****************************************************************************************
 */
#define MAC_ST_SUCCESSFUL                   0
#define MAC_ST_FAILURE                      1
#define MAC_ST_RESERVED                     2
#define MAC_ST_CAPA_NOT_SUPPORTED           10
#define MAC_ST_REASSOC_NOT_ASSOC            11
#define MAC_ST_ASSOC_DENIED                 12
#define MAC_ST_AUTH_ALGO_NOT_SUPPORTED      13
#define MAC_ST_AUTH_FRAME_WRONG_SEQ         14
#define MAC_ST_AUTH_CHALLENGE_FAILED        15
#define MAC_ST_AUTH_TIMEOUT                 16
#define MAC_ST_ASSOC_TOO_MANY_STA           17
#define MAC_ST_ASSOC_RATES_NOT_SUPPORTED    18
#define MAC_ST_ASSOC_PREAMBLE_NOT_SUPPORTED 19

#define MAC_ST_ASSOC_SPECTRUM_REQUIRED   22
#define MAC_ST_ASSOC_POWER_CAPA          23
#define MAC_ST_ASSOC_SUPPORTED_CHANNEL   24
#define MAC_ST_ASSOC_SLOT_NOT_SUPPORTED  25
#define MAC_ST_ASSOC_MODE_NOT_SUPPORTED  27

#define MAC_ST_REFUSED_TEMPORARILY       30
#define MAC_ST_INVALID_MFP_POLICY        31

#define MAC_ST_INVALID_IE                40             // draft 7.0 extention
#define MAC_ST_GROUP_CIPHER_INVALID      41             // draft 7.0 extention
#define MAC_ST_PAIRWISE_CIPHER_INVALID   42             // draft 7.0 extention
#define MAC_ST_AKMP_INVALID              43             // draft 7.0 extention
#define MAC_ST_UNSUPPORTED_RSNE_VERSION  44             // draft 7.0 extention
#define MAC_ST_INVALID_RSNE_CAPA         45             // draft 7.0 extention
#define MAC_ST_CIPHER_SUITE_REJECTED     46             // draft 7.0 extention


/*
* REASON CODE
****************************************************************************************
*/
#define MAC_RS_RESERVED                           0
#define MAC_RS_UNSPECIFIED                        1
#define MAC_RS_PREVIOUS_AUTH_NOT_VALID            2
#define MAC_RS_DEAUTH_SENDER_LEFT_IBSS_ESS        3
#define MAC_RS_DIASSOC_INACTIVITY                 4
#define MAC_RS_DIASSOC_TOO_MANY_STA               5
#define MAC_RS_CLASS_2_FORBIDDEN                  6
#define MAC_RS_CLASS_3_FORBIDDEN                  7
#define MAC_RS_DEAUTH_SENDER_LEFT_BSS             8
#define MAC_RS_STA_REQ_ASSOC_NOT_AUTH             9
#define MAC_RS_DIASSOC_POWER_CAPA                10
#define MAC_RS_DIASSOC_SUPPORTED_CHANNEL         11
#define MAC_RS_RESERVED_12                       12
#define MAC_RS_INVALID_IE                        13
#define MAC_RS_MIC_FAILURE                       14
#define MAC_RS_4WAY_HANDSHAKE_TIMEOUT            15
#define MAC_RS_GROUP_KEY_UPDATE_TIMEOUT          16
#define MAC_RS_BAD_RSNIE                         17
#define MAC_RS_GROUP_CIPHER_INVALID              18
#define MAC_RS_PAIRWISE_CIPHER_INVALID           19
#define MAC_RS_AKMP_INVALID                      20
#define MAC_RS_UNSUPPORTED_RSNE_VERSION          21
#define MAC_RS_INVALID_RSNE_CAPA                 22
#define MAC_RS_802_1X_AUTH_FAIL                  23
#define MAC_RS_CIPHER_SUITE_REJECTED             24
#define MAC_RS_TIMEOUT                           39
#define VENDOR_CONNECTION_LOSS                   40


#define MAC_RAW_WME_INFO_ELMT_DEFAULT                                         \
{                                                                             \
    MAC_ELTID_OUI, 0x07,                                                      \
    0x00, 0x50, 0xF2, MAC_OUI_TYPE_WME,         /* additionnal WPA OUI     */ \
    MAC_OUI_SUBTYPE_WME_INFORMATION, 0x01,      /* OUI subtype and version */ \
    0x00                                        /* QoS field               */ \
}

/// EDCA parameter set values
// Best effort
#define MAC_ACI_BE                        0
// Background
#define MAC_ACI_BK                        1
// Video
#define MAC_ACI_VI                        2
// Voice
#define MAC_ACI_VO                        3

#define MAC_ACI_OFT                       5

#define MAC_ECWMIN                        4
#define MAC_ECWMAX                        10

#define MAC_ECW_BK_MIN                  MAC_ECWMIN
#define MAC_ECW_BE_MIN                  MAC_ECWMIN
//#define MAC_ECW_VI_MIN                  ((MAC_ECWMIN+1)/2 - 1)
//#define MAC_ECW_VO_MIN                  ((MAC_ECWMIN+1)/4 - 1)
#define MAC_ECW_VI_MIN                  ((MAC_ECWMIN) - 1)
#define MAC_ECW_VO_MIN                  ((MAC_ECWMIN)/2)

#define MAC_ECW_BK_MAX                  MAC_ECWMAX
#define MAC_ECW_BE_MAX                  MAC_ECWMAX
#define MAC_ECW_VI_MAX                  MAC_ECWMIN
//#define MAC_ECW_VO_MAX                  ((MAC_ECWMIN+1)/2 - 1)
#define MAC_ECW_VO_MAX                  ((MAC_ECWMIN) - 1)

#define MAC_AIFSN_BK                    7
#define MAC_AIFSN_BE                    3
#define MAC_AIFSN_VI                    2
#define MAC_AIFSN_VO                    2

#define MAC_AC_BE_TXOP                  0
#define MAC_AC_BK_TXOP                  0
#define MAC_AC_VI_TXOP_b                188    // 6016us / 32 us
#define MAC_AC_VI_TXOP_ag               94     // 3008 ms / 32 usec


#define MAC_AC_VO_TXOP_b                102    // 3264us / 32 us
#define MAC_AC_VO_TXOP_ag                47    // 1504us / 32 us


#define MAC_EDCA_DEFAULT_STA                                                            \
{                                                                                       \
 /*  TXOP (LSB.MSB), (MAC_ECW_XX_MAX<<4)|MAC_ECW_XX_MIN, (AIFSN)*/                      \
    (MAC_AC_BK_TXOP & 0xFF),(MAC_AC_BK_TXOP>>8), (MAC_ECW_BK_MAX<<4)|MAC_ECW_BK_MIN, (MAC_ACI_BK<<5)|MAC_AIFSN_BK,  \
    (MAC_AC_BE_TXOP & 0xFF),(MAC_AC_BE_TXOP>>8), (MAC_ECW_BE_MAX<<4)|MAC_ECW_BE_MIN, (MAC_ACI_BE<<5)|MAC_AIFSN_BE,  \
    (MAC_AC_VI_TXOP_ag & 0xFF),(MAC_AC_VI_TXOP_ag>>8), (MAC_ECW_VI_MAX<<4)|MAC_ECW_VI_MIN, (MAC_ACI_VI<<5)|MAC_AIFSN_VI, \
    (MAC_AC_VO_TXOP_ag & 0xFF),(MAC_AC_VO_TXOP_ag>>8), (MAC_ECW_VO_MAX<<4)|MAC_ECW_VO_MIN, (MAC_ACI_VO<<5)|MAC_AIFSN_VO  \
}

#define MAC_EDCA_DEFAULT_AP                                                             \
{                                                                                       \
 /*  TXOP (LSB.MSB), (MAC_ECW_XX_MAX<<4)|MAC_ECW_XX_MIN, (AIFSN)*/                      \
    (MAC_AC_BK_TXOP & 0xFF),(MAC_AC_BK_TXOP>>8), (10<<4)| 4, (MAC_ACI_BK<<5)|MAC_AIFSN_BK,  \
    (MAC_AC_BE_TXOP & 0xFF),(MAC_AC_BE_TXOP>>8), (6<<4)| 4, (MAC_ACI_BE<<5)|MAC_AIFSN_BE, \
    (MAC_AC_VI_TXOP_ag & 0xFF),(MAC_AC_VI_TXOP_ag>>8), (4<<4)| 3, (MAC_ACI_VI<<5)|((MAC_AIFSN_VI)-1), \
    (MAC_AC_VO_TXOP_ag & 0xFF),(MAC_AC_VO_TXOP_ag>>8), (3<<4)| 2, (MAC_ACI_VO<<5)|((MAC_AIFSN_VO)-1)  \
}

// WME Parameter Element
#define MAC_RAW_WME_PARAM_DEFAULT                                                        \
{                                                                                        \
    MAC_ELTID_OUI, 0x18,                                                               \
    0x00, 0x50, 0xF2, MAC_OUI_TYPE_WME,         /* additionnal WPA OUI                */ \
    MAC_OUI_SUBTYPE_WME_PARAMETER, 0x01,        /* OUI subtype and version            */ \
    0x00,                                       /* QoS field                          */ \
    0x00,                                       /* reserved                           */ \
 /*  TXOP (LSB.MSB), (MAC_ECW_XX_MAX<<4)|MAC_ECW_XX_MIN, (AIFSN)*/                       \
    (MAC_ACI_BE<<5)|MAC_AIFSN_BE, (MAC_ECW_BE_MAX<<4)|MAC_ECW_BE_MIN,  (MAC_AC_BE_TXOP & 0xFF),(MAC_AC_BE_TXOP>>8),  \
    (MAC_ACI_BK<<5)|MAC_AIFSN_BK, (MAC_ECW_BK_MAX<<4)|MAC_ECW_BK_MIN, (MAC_AC_BK_TXOP & 0xFF),(MAC_AC_BK_TXOP>>8),  \
    (MAC_ACI_VI<<5)|MAC_AIFSN_VI, (MAC_ECW_VI_MAX<<4)|MAC_ECW_VI_MIN, (MAC_AC_VI_TXOP_ag & 0xFF),(MAC_AC_VI_TXOP_ag>>8),\
    (MAC_ACI_VO<<5)|MAC_AIFSN_VO, (MAC_ECW_VO_MAX<<4)|MAC_ECW_VO_MIN, (MAC_AC_VO_TXOP_ag & 0xFF),(MAC_AC_VO_TXOP_ag>>8) \
}

#define MAC_WME_PARAM_AP_b              \
{                                       \
 /* (MAC_ACI_XX<<5)|MAC_AIFSN_XX, (MAC_ECW_XX_MIN<<4)|MAC_ECW_XX_MAX, (MAC_AC_XX_TXOP & 0xFF),(MAC_AC_XX_TXOP>>8)*/\
    (MAC_ACI_BE<<5)|MAC_AIFSN_BE, (MAC_ECW_BE_MIN<<4)|MAC_ECW_BE_MAX, (MAC_AC_BE_TXOP & 0xFF),(MAC_AC_BE_TXOP>>8),  \
    (MAC_ACI_BK<<5)|MAC_AIFSN_BK, (MAC_ECW_BK_MIN<<4)|MAC_ECW_BK_MAX, (MAC_AC_BK_TXOP & 0xFF),(MAC_AC_BK_TXOP>>8),  \
    (MAC_ACI_VI<<5)|MAC_AIFSN_VI, (MAC_ECW_VI_MIN<<4)|MAC_ECW_VI_MAX, (MAC_AC_VI_TXOP_b & 0xFF),(MAC_AC_VI_TXOP_b>>8), \
    (MAC_ACI_VO<<5)|MAC_AIFSN_VO, (MAC_ECW_VO_MIN<<4)|MAC_ECW_VO_MAX, (MAC_AC_VO_TXOP_b & 0xFF),(MAC_AC_VO_TXOP_b>>8)  \
}

#define MAC_WME_PARAM_AP_ag             \
{                                       \
 /* (MAC_ACI_XX<<5)|MAC_AIFSN_XX, (MAC_ECW_XX_MIN<<4)|MAC_ECW_XX_MAX, (MAC_AC_XX_TXOP & 0xFF),(MAC_AC_XX_TXOP>>8)*/\
    (MAC_ACI_BE<<5)|MAC_AIFSN_BE, (MAC_ECW_BE_MIN<<4)|MAC_ECW_BE_MAX, (MAC_AC_BE_TXOP & 0xFF),(MAC_AC_BE_TXOP>>8),  \
    (MAC_ACI_BK<<5)|MAC_AIFSN_BK, (MAC_ECW_BK_MIN<<4)|MAC_ECW_BK_MAX, (MAC_AC_BK_TXOP & 0xFF),(MAC_AC_BK_TXOP>>8),  \
    (MAC_ACI_VI<<5)|MAC_AIFSN_VI, (MAC_ECW_VI_MIN<<4)|MAC_ECW_VI_MAX, (MAC_AC_VI_TXOP_ag & 0xFF),(MAC_AC_VI_TXOP_ag>>8), \
    (MAC_ACI_VO<<5)|MAC_AIFSN_VO, (MAC_ECW_VO_MIN<<4)|MAC_ECW_VO_MAX, (MAC_AC_VO_TXOP_ag & 0xFF),(MAC_AC_VO_TXOP_ag>>8)  \
}

 // RSN Information element related fields
 #define MAC_RSNIE_WPA_OUI_LEN           4
 #define MAC_RSNIE_GROUP_KEY_OFT         7
 #define MAC_RSNIE_PAIRWISE_KEY_CNT_OFT  8
 #define MAC_RSNIE_PAIRWISE_KEY_OFT     13

 // Cipher suite selectors
 #define MAC_RSNIE_CIPHER_MASK    0x07
 #define MAC_RSNIE_CIPHER_WEP40   0x00
 #define MAC_RSNIE_CIPHER_TKIP    0x01
 #define MAC_RSNIE_CIPHER_CCMP    0x02
 #define MAC_RSNIE_CIPHER_WEP104  0x03
 #define MAC_RSNIE_CIPHER_WPI_SMS4 0x04
 #define MAC_RSNIE_CIPHER_AES_CMAC 0x05

 #define MAC_RSNIE_CIPHER_NOSEC   0xFE
 #define MAC_RSNIE_CIPHER_INVALID 0xFF

 // Authentication and key management suite selectors
 #define MAC_RSNIE_KEYMGT_8021X    1
 #define MAC_RSNIE_KEYMGT_PSK      2


// TKIP and CCMP OUI
#define MAC_RAW_ENC_WPA_TKIP                                                         \
{                                                                                    \
    MAC_ELTID_OUI, 0x16,                                                             \
    0x00, 0x50, 0xF2, MAC_OUI_TYPE_WPA,         /* additionnal WPA OUI                                                     */ \
    0x01, 0x00,                                 /* version                                                                 */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_TKIP,    /* group key cipher    (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* pairwise key cipher number                                              */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_TKIP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* authentication key management number                                    */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_KEYMGT_PSK      /* authentication key management (01==802.1X auth, 02==PSK)                */ \
}

#define MAC_RAW_ENC_WPA_CCMP                                                         \
{                                                                                   \
    MAC_ELTID_OUI, 0x16,                                                             \
    0x00, 0x50, 0xF2, MAC_OUI_TYPE_WPA,         /* additionnal WPA OUI                                                     */ \
    0x01, 0x00,                                 /* version                                                                 */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_CCMP,    /* group key cipher    (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* pairwise key cipher number                                              */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_CCMP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* authentication key management number                                    */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_KEYMGT_PSK      /* authentication key management (01==802.1X auth, 02==PSK)                */ \
}

#define MAC_RAW_ENC_WPA_MIXED                                                         \
{                                                                                    \
    MAC_ELTID_OUI, 0x1A,                                                              \
    0x00, 0x50, 0xF2, MAC_OUI_TYPE_WPA,         /* additionnal WPA OUI                                                     */ \
    0x01, 0x00,                                 /* version                                                                 */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_TKIP,    /* group key cipher    (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x02, 0x00,                                 /* pairwise key cipher number                                              */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_CCMP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x00, 0x50, 0xF2, MAC_RSNIE_CIPHER_TKIP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* authentication key management number                                    */ \
    0x00, 0x50, 0xF2, MAC_RSNIE_KEYMGT_PSK      /* authentication key management (01==802.1X auth, 02==PSK)                */ \
}

#define MAC_RAW_ENC_RSN_TKIP                                                         \
{{                                                                                       \
    MAC_ELTID_RSN_IEEE, 0x14,                                                            \
    0x01, 0x00,                                 /* version                                                                 */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_TKIP,    /* group key cipher    (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* pairwise key cipher number                                              */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_TKIP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* authentication key management number                                    */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_KEYMGT_PSK,     /* authentication key management (01==802.1X auth, 02==PSK)                */ \
    0x00, 0x00                                  /* no pre-authentication capabilities   */                                    \
}}

#define MAC_RAW_ENC_RSN_CCMP                                                        \
{{                                                                                       \
    MAC_ELTID_RSN_IEEE, 0x14,                                                            \
    0x01, 0x00,                                 /* version                                                                 */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_CCMP,    /* group key cipher    (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* pairwise key cipher number                                              */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_CCMP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* authentication key management number                                    */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_KEYMGT_PSK,     /* authentication key management (01==802.1X auth, 02==PSK)                */ \
    0x00, 0x00                                  /* no pre-authentication capabilities   */                                    \
}}


